04_Simulation/PH_Cases/Mesh_180_by_195/steadyState_2D_Baseline_RANS_SST/0/R
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      R;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<symmTensor> 
35100
(
(6.7000315e-16 -3.0999102e-16 -0 6.6666667e-16 -0 6.6666667e-16)
(6.6490284e-16 -3.0999749e-16 -0 6.6666667e-16 -0 6.6666667e-16)
(6.4219803e-16 -3.0951679e-16 -0 6.6666667e-16 -0 6.6666667e-16)
(6.0261499e-16 -3.0667359e-16 -0 6.6666667e-16 -0 6.6666667e-16)
(5.4921875e-16 -2.986687e-16 8.6588571e-34 6.6666667e-16 -0 6.6666667e-16)
(4.8883596e-16 -2.8335158e-16 -0 6.6666667e-16 -0 6.6666667e-16)
(4.325376e-16 -2.6209119e-16 1.5576441e-39 6.6666667e-16 -0 6.6666667e-16)
(3.9349572e-16 -2.4246405e-16 -1.582864e-33 6.6666667e-16 -0 6.6666667e-16)
...
)
;

boundaryField
{
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    top
    {
        type            fixedValue;
        value           uniform (0 0 -0 0 -0 0);
    }
    hills
    {
        type            fixedValue;
        value           uniform (0 -0 0 0 -0 0);
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
