04_Simulation/PH_Cases/Mesh_180_by_195/steadyState_2D_Baseline_RANS_SST/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{

    "(inlet|outlet)"
    {
        type            cyclic;
    }

    "(front|back)"
    {
        type            empty;
    }

    "(top|hills)"
    {
		type            nutUWallFunction;   
        	value           uniform 0;
    }
}

// ************************************************************************* //
