04_Simulation/PH_Cases/Mesh_180_by_195/steadyState_2D_Baseline_RANS_SST/0/wallGradU
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      wallGradU;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    top
    {
        type            calculated;
        value           nonuniform List<vector> 
180
(
(4.1976439 -0 -0)
(4.1977805 -0 -0)
(4.1954511 -0 -0)
(4.1875834 -0 -0)
(4.1713911 -0 -0)
(4.1448096 -0 -0)
(4.1072115 -0 -0)
(4.0604029 -0 -0)
...
)
;
    }
    hills
    {
        type            calculated;
        value           nonuniform List<vector> 
180
(
(4.1554756 -0 -0)
(4.1556159 -0 -0)
(4.1571875 -0 -0)
(4.1705013 -0 -0)
(4.2143123 -0 -0)
(4.3108817 -0 -0)
(4.4681777 -0 -0)
(4.6300306 -0 -0)
...
)
;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
