04_Simulation/PH_Cases/Mesh_180_by_195/steadyState_2D_Baseline_RANS_SST/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication blockMesh

runApplication topoSet

runApplication decomposePar

runParallel simpleFoam


