04_Simulation/PH_Cases/Mesh_180_by_195/steadyState_2D_Baseline_RANS_SST/constant/RASProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      RASProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType RASModel;


    RASModel               kOmegaSST; //kOmegaSSTKCIModelsComb; //kOmegaSST;

    turbulence          on;

    printCoeffs         on;
    
    
     /* kOmegaSSTKCIModelsCombCoeffs {
       model Tr.prod.squCyl.Iter0.region_Ha4; // you need to also run the other model Tr.prod.squCyl.Iter0.region_Ha1Ha4
       //betaStar 0.082;

       } */

         
// ************************************************************************* //
