04_Simulation/PH_Cases/Mesh_180_by_195/steadyState_2D_Baseline_RANS_SST/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          195;
        startFace       69825;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  outlet;
    }
    outlet
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          195;
        startFace       70020;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  inlet;
    }
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          180;
        startFace       70215;
    }
    hills
    {
        type            wall;
        inGroups        1(wall);
        nFaces          180;
        startFace       70395;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          35100;
        startFace       70575;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          35100;
        startFace       105675;
    }
)

// ************************************************************************* //
